embeddedci-com/examples/scenario-sensors-stm32/main.c
/*
 * STM32 scenario app:
 * - USART1 interactive menu (line-buffering off for interactive echo)
 * - rotor / stepper outputs on PC10/PC11
 *     * "rotors on/off" energises both pins (legacy rotor behaviour)
 *     * "rotors step <n> [fwd|rev]" drives them as a step/direction stepper
 *       interface (PC10 = STEP pulse, PC11 = DIR), as for an A4988/DRV8825
 * - stepper health monitor: "monitor pwm [seconds]" measures a PWM feedback
 *   signal on PA0 (TIM2_CH1) each cycle and flags "failure detected" if the
 *   PWM stops (signal lost / motor stalled)
 * - BMP280 on I2C1 (PB8/PB9), auto-detect 0x76/0x77
 * - VL53L0X on same bus (default addr 0x29) for bus validation
 */

#include "stm32f4xx_hal.h"
#include "VL53L0X.h"
#include "i2c.h"
#include <math.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#define CMD_BUF_SIZE 64
#define BMP280_CHIP_ID 0x58U
#define BMP280_REG_CHIP_ID 0xD0U
#define BMP280_REG_RESET 0xE0U
#define BMP280_REG_STATUS 0xF3U
#define BMP280_REG_CTRL_MEAS 0xF4U
#define BMP280_REG_CONFIG 0xF5U
#define BMP280_REG_PRESS_MSB 0xF7U
#define BMP280_REG_CALIB_START 0x88U

#define BMP280_I2C_ADDR0 0x76U
#define BMP280_I2C_ADDR1 0x77U
#define BMP280_TIMEOUT_MS 100U
#define BMP280_SEA_LEVEL_PA 101325.0f

#define VL53L0X_I2C_ADDR_7B 0x29U
#define VL53L0X_MODEL_ID_EXPECTED 0xEEU

#define I2C_SCAN_ADDR_FIRST 0x08U
#define I2C_SCAN_ADDR_LAST 0x77U
#define I2C_ISREADY_TRIALS 3U
#define I2C_ISREADY_TIMEOUT_MS 10U

/* Boot attach window (ms): main() holds this long before touching any peripheral
 * so a host flasher that just reset us (NRST, an eFuse power-cycle, or the UART
 * "reset" command below) can connect SWD and halt during a known-quiet window.
 * This app never repurposes PA13/PA14, so SWD stays available regardless, but the
 * window + software reset make attach/flash deterministic on rigs with no NRST. */
#define FLASH_ATTACH_WINDOW_MS 200U

/* Stepper (step/direction) on the former rotor pins.  PC10 = STEP (one motor
 * step per rising edge), PC11 = DIR (level selects rotation direction). This is
 * the signalling a common stepper driver module (A4988/DRV8825) expects. */
#define STEP_PORT GPIOC
#define STEP_PIN GPIO_PIN_10
#define DIR_PIN GPIO_PIN_11
#define STEP_HALF_PERIOD_MS 1U /* 1ms high + 1ms low -> ~500 steps/s */
#define STEP_MAX_COUNT 100000U

/* PWM feedback monitor.  We measure the PWM on PA0 (TIM2_CH1) using the timer's
 * PWM-input mode: CH1 (rising) captures the period, CH2 (falling) the high time. */
#define PWM_MON_DEFAULT_SEC 5U
#define PWM_MON_MIN_SEC 1U
#define PWM_MON_MAX_SEC 3600U
#define PWM_MEAS_WINDOW_MS 400U /* no edge within this window = signal lost */
#define PWM_TIM_HZ 1000000U     /* timer timebase: 1 MHz -> 1 tick = 1 us */

typedef struct
{
    uint16_t dig_T1;
    int16_t dig_T2;
    int16_t dig_T3;
    uint16_t dig_P1;
    int16_t dig_P2;
    int16_t dig_P3;
    int16_t dig_P4;
    int16_t dig_P5;
    int16_t dig_P6;
    int16_t dig_P7;
    int16_t dig_P8;
    int16_t dig_P9;
    int32_t t_fine;
} bmp280_calibration_t;

typedef struct
{
    I2C_HandleTypeDef hi2c1;
    uint8_t i2c_addr_7b;
    uint8_t detected;
    uint8_t initialized;
    uint32_t read_count;
    uint32_t read_fail_count;
    float temperature_c;
    float pressure_pa;
    float altitude_m;
} sensor_state_t;

typedef struct
{
    uint8_t detected;
    uint8_t initialized;
    uint8_t last_model_id;
    uint16_t last_range_mm;
    uint32_t read_count;
    uint32_t read_fail_count;
} vl53l0x_state_t;

static volatile char cmd_buffer[CMD_BUF_SIZE];
static volatile uint8_t cmd_index = 0;
static volatile uint8_t cmd_ready = 0;

static uint8_t rx_byte;
static volatile uint32_t rx_byte_count = 0;
static volatile uint32_t command_count = 0;
static uint8_t rx_last_was_cr = 0U;

/* Interrupt-driven RX ring buffer.  USART1 has a single RDR (no RX FIFO) and the
 * main loop sleeps in __WFI between SysTicks, so polling RDR drops bytes on a
 * back-to-back burst — a host command sent at line rate (~87 us/byte @115200)
 * overruns RDR and the loop sees only the first byte or two.  An RX interrupt
 * drains RDR the moment each byte lands into this ring; readers consume it. */
#define RX_RING_SIZE 256u
static volatile uint8_t  rx_ring[RX_RING_SIZE];
static volatile uint16_t rx_ring_head = 0;   /* written by the ISR  */
static volatile uint16_t rx_ring_tail = 0;   /* read by the main loop */

static sensor_state_t g_sensor;
static bmp280_calibration_t g_calib;
static vl53l0x_state_t g_vl53;
static struct VL53L0X g_vl53_dev;
static uint8_t g_i2c1_hw_inited = 0U;
static TIM_HandleTypeDef g_pwm_tim;

void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void USART1_Init(void);
static void I2C1_Init(void);
static int i2c1_ensure_init(void);
void HAL_I2C_MspInit(I2C_HandleTypeDef *hi2c);
void HAL_I2C_MspDeInit(I2C_HandleTypeDef *hi2c);
static int usart1_read_byte_nonblocking(uint8_t *byte);
static void uart_process_rx_byte(uint8_t byte);
static void print_prompt(void);
static void process_command(char *cmd);
static void print_help(void);
static void print_status(void);
static void set_rotors(GPIO_PinState state);
static uint32_t parse_u32_default(const char *s, uint32_t defval);
static uint32_t rotor_step(uint32_t steps, int reverse);
static void handle_rotor_step(const char *args);
static void pwm_input_init(void);
static void pwm_input_deinit(void);
static int pwm_measure(uint32_t *freq_hz, uint32_t *duty_pct, uint32_t *period_us);
static void monitor_pwm_until_key(uint32_t period_sec);
void HAL_TIM_IC_MspInit(TIM_HandleTypeDef *htim);
void HAL_TIM_IC_MspDeInit(TIM_HandleTypeDef *htim);
static void monitor_i2c_until_key(void);
static void sensor_init_until_key(void);
static int bmp280_probe_and_init(uint8_t verbose);
static int bmp280_read_measurement(float *temperature_c, float *pressure_pa, float *altitude_m);
static int bmp280_read_regs(uint8_t reg, uint8_t *buf, uint16_t len, uint8_t verbose);
static int bmp280_write_reg(uint8_t reg, uint8_t value, uint8_t verbose);
static void i2c_dump_hal_context(const char *tag, HAL_StatusTypeDef st);
static void i2c_dump_hal_error_bits(uint32_t err);
static void i2c_recover(void);
static void i2c_bus_scan(void);
static int vl53l0x_init(uint8_t verbose);
static int vl53l0x_read_model_id(uint8_t verbose);
static int vl53l0x_read_range_mm(uint16_t *range_mm, uint8_t verbose);
static int sensor_i2c_deinit(void);
static const char *hal_status_to_str(HAL_StatusTypeDef status);
static int32_t bmp280_compensate_temp(int32_t adc_T);
static uint32_t bmp280_compensate_press(int32_t adc_P);
static float pressure_to_altitude_m(float pressure_pa);
static int32_t round_float_to_int(float value);
static int32_t round_float_to_centi(float value);
static void fault_led_prepare(void);
static void fault_led_delay(volatile uint32_t cycles);
static void fault_led_blink_loop(uint32_t pulses) __attribute__((noreturn));

int _write(int file, char *ptr, int len)
{
    (void)file;
    for (int i = 0; i < len; i++)
    {
        while ((USART1->SR & USART_SR_TXE) == 0U)
        {
        }
        USART1->DR = (uint8_t)ptr[i];
    }
    return len;
}

int main(void)
{
    HAL_Init();
    SystemClock_Config();

    /* Flash-friendliness: keep the debug port (SWD) fully alive even while the
     * app sleeps in __WFI(), so a host can always attach/halt/flash without a
     * hardware reset line. */
    HAL_DBGMCU_EnableDBGSleepMode();
    HAL_DBGMCU_EnableDBGStopMode();
    HAL_DBGMCU_EnableDBGStandbyMode();

    /* Give a flasher a clean, quiet window to connect SWD and halt right after a
     * reset, before we start driving GPIO / I2C / UART. See FLASH_ATTACH_WINDOW_MS. */
    HAL_Delay(FLASH_ATTACH_WINDOW_MS);

