embeddedci-com/examples/scenario-sensors-stm32/main.c
    MX_GPIO_Init();
    USART1_Init();
    (void)setvbuf(stdout, NULL, _IONBF, 0);

    memset(&g_sensor, 0, sizeof(g_sensor));
    memset(&g_vl53, 0, sizeof(g_vl53));
    memset(&g_vl53_dev, 0, sizeof(g_vl53_dev));
    g_vl53_dev.io_2v8 = true;
    g_vl53_dev.address = VL53L0X_I2C_ADDR_7B;
    g_vl53_dev.io_timeout = BMP280_TIMEOUT_MS;
    g_vl53_dev.did_timeout = false;
    I2C1_Init();
    (void)bmp280_probe_and_init(1U);
    printf("\r\nVL53L0X init (boot):\r\n");
    (void)vl53l0x_init(1U);

    HAL_Delay(50);
    printf("\r\nSCENARIO: stm32 bmp280 + vl53l0x + rotor control\r\n");
    printf("SCENARIO: build=%s %s\r\n", __DATE__, __TIME__);
    printf("SCENARIO: cpu=%lu Hz\r\n", HAL_RCC_GetHCLKFreq());
    printf("SCENARIO: uart=USART1(115200), i2c=I2C1 PB8/PB9\r\n");
    printf("APP_OK\r\n");
    printf("type a command and press Enter (e.g. help)\r\n");
    print_prompt();

    while (1)
    {
        while (usart1_read_byte_nonblocking(&rx_byte))
        {
            uart_process_rx_byte(rx_byte);
        }

        if (cmd_ready)
        {
            cmd_ready = 0;
            process_command((char *)cmd_buffer);
            memset((void *)cmd_buffer, 0, CMD_BUF_SIZE);
            cmd_index = 0;
            print_prompt();
        }

        __WFI();
    }
}

static void print_prompt(void)
{
    printf("> ");
    (void)fflush(stdout);
}

/* RX interrupt: drain RDR (and clear a possible overrun) into the ring the moment
 * bytes arrive, so a line-rate burst is never lost while the main loop is asleep.
 * Reading DR clears RXNE; reading SR then DR clears ORE. */
void USART1_IRQHandler(void)
{
    while ((USART1->SR & (USART_SR_RXNE | USART_SR_ORE)) != 0U)
    {
        uint8_t byte = (uint8_t)(USART1->DR & 0xFFU);
        uint16_t next = (uint16_t)((rx_ring_head + 1U) % RX_RING_SIZE);
        if (next != rx_ring_tail)      /* drop on full rather than clobber unread */
        {
            rx_ring[rx_ring_head] = byte;
            rx_ring_head = next;
        }
    }
}

static int usart1_read_byte_nonblocking(uint8_t *byte)
{
    if (rx_ring_tail == rx_ring_head)
    {
        return 0;                      /* ring empty */
    }
    *byte = rx_ring[rx_ring_tail];
    rx_ring_tail = (uint16_t)((rx_ring_tail + 1U) % RX_RING_SIZE);
    return 1;
}

static void uart_process_rx_byte(uint8_t byte)
{
    rx_byte_count++;

    if (byte == '\r')
    {
        rx_last_was_cr = 1U;
        printf("\r\n");
        if (cmd_index > 0U)
        {
            cmd_buffer[cmd_index] = '\0';
            cmd_ready = 1;
        }
        else
        {
            print_prompt();
        }
    }
    else if (byte == '\n')
    {
        if (rx_last_was_cr)
        {
            rx_last_was_cr = 0U;
            return;
        }
        printf("\r\n");
        if (cmd_index > 0U)
        {
            cmd_buffer[cmd_index] = '\0';
            cmd_ready = 1;
        }
        else
        {
            print_prompt();
        }
    }
    else if (byte == '\b' || byte == 0x7FU)
    {
        if (cmd_index > 0U)
        {
            cmd_index--;
            cmd_buffer[cmd_index] = '\0';
            printf("\b \b");
            (void)fflush(stdout);
        }
    }
    else if (byte >= 32U && byte <= 126U)
    {
        rx_last_was_cr = 0U;
        if (cmd_index < (CMD_BUF_SIZE - 1U))
        {
            cmd_buffer[cmd_index++] = (char)byte;
            printf("%c", (char)byte);
            (void)fflush(stdout);
        }
    }
}

static void process_command(char *cmd)
{
    command_count++;

    if (strcmp(cmd, "help") == 0)
    {
        print_help();
    }
    else if (strcmp(cmd, "status") == 0)
    {
        print_status();
    }
    else if (strcmp(cmd, "rotors on") == 0 || strcmp(cmd, "pc10pc11 on") == 0)
    {
        set_rotors(GPIO_PIN_SET);
        printf("ROTORS=ON (PC10=ON, PC11=ON)\r\n");
    }
    else if (strcmp(cmd, "rotors off") == 0 || strcmp(cmd, "pc10pc11 off") == 0)
    {
        set_rotors(GPIO_PIN_RESET);
        printf("ROTORS=OFF (PC10=OFF, PC11=OFF)\r\n");
    }
    else if (strncmp(cmd, "rotors step", 11) == 0 && (cmd[11] == '\0' || cmd[11] == ' '))
    {
        handle_rotor_step(cmd + 11);
    }
    else if (strcmp(cmd, "monitor i2c") == 0)
    {
        monitor_i2c_until_key();
    }
    else if (strncmp(cmd, "monitor pwm", 11) == 0 && (cmd[11] == '\0' || cmd[11] == ' '))
    {
        uint32_t sec = parse_u32_default(cmd + 11, PWM_MON_DEFAULT_SEC);
        if (sec < PWM_MON_MIN_SEC)
        {
            sec = PWM_MON_MIN_SEC;
        }
        if (sec > PWM_MON_MAX_SEC)
        {
            sec = PWM_MON_MAX_SEC;
        }
        monitor_pwm_until_key(sec);
    }
    else if (strcmp(cmd, "sensor init") == 0)
    {
        sensor_init_until_key();
    }
    else if (strcmp(cmd, "i2c scan") == 0)
    {
        if (i2c1_ensure_init() == 0)
        {
            i2c_bus_scan();
        }
    }
    else if (strcmp(cmd, "vl53 test") == 0 || strcmp(cmd, "vl53l0x test") == 0)
    {
        if (i2c1_ensure_init() == 0)
        {
            (void)vl53l0x_read_model_id(1U);
        }
    }
    else if (strcmp(cmd, "sensor deinit") == 0)
    {
        (void)sensor_i2c_deinit();
        printf("I2C1 deinitialized; use \"sensor init\", \"i2c scan\", or \"vl53 test\" to run I2C1_Init() again.\r\n");
    }
    else if (strcmp(cmd, "reset") == 0 || strcmp(cmd, "reboot") == 0)
    {
        /* Software reset over UART: lets a host reset the DUT without an NRST wire,
         * then attach SWD during the boot window (see FLASH_ATTACH_WINDOW_MS). */
        printf("RESET: rebooting via NVIC_SystemReset()\r\n");
        (void)fflush(stdout);
        HAL_Delay(20); /* let the line drain before the core resets */
        NVIC_SystemReset();
    }
    else
    {
        printf("unknown: %s\r\n", cmd);
    }
}

static void print_help(void)
{
    printf("commands:\r\n");
    printf("  help\r\n");
    printf("  status\r\n");
    printf("  rotors on\r\n");
    printf("  rotors off\r\n");
    printf("  rotors step <n> [fwd|rev]  (PC10=STEP pulses, PC11=DIR; ~500 steps/s; any key aborts)\r\n");
    printf("  monitor i2c   (reads BMP280 every 1s, press any key to stop)\r\n");
    printf("  monitor pwm [seconds]  (measure PWM on PA0/TIM2_CH1 each cycle; default 5s;\r\n");
    printf("                          prints 'failure detected' if the PWM is lost; any key stops)\r\n");
    printf("  sensor init   (BMP280 + VL53L0X, 500ms retry; I2C scan once at start; any key stops)\r\n");
    printf("  i2c scan      (HAL_I2C_IsDeviceReady 0x08-0x77, highlights 0x29)\r\n");
    printf("  vl53 test     (read VL53L0X model ID reg 0xC0; alias: vl53l0x test)\r\n");
    printf("  sensor deinit (HAL_I2C_DeInit + clear sensor state; re-init via sensor init / i2c scan / vl53 test)\r\n");
    printf("  reset         (NVIC_SystemReset; software reboot so a host can reset+attach without NRST; alias: reboot)\r\n");
}

static void print_status(void)
{
    GPIO_PinState pc10 = HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_10);
    GPIO_PinState pc11 = HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_11);
    int sensor_ok = (bmp280_read_measurement(&g_sensor.temperature_c, &g_sensor.pressure_pa, &g_sensor.altitude_m) == 0);
    if (sensor_ok)
    {
        g_sensor.read_count++;
    }
    else
    {
        g_sensor.read_fail_count++;
    }

    printf("status:\r\n");
    printf("  pc10(STEP)=%s\r\n", (pc10 == GPIO_PIN_SET) ? "HIGH" : "LOW");
    printf("  pc11(DIR)=%s\r\n", (pc11 == GPIO_PIN_SET) ? "rev" : "fwd");
    printf("  bmp280_detected=%s\r\n", g_sensor.detected ? "yes" : "no");
    if (g_sensor.detected)
    {
        printf("  bmp280_addr=0x%02X\r\n", g_sensor.i2c_addr_7b);
    }
    printf("  sensor_initialized=%s\r\n", g_sensor.initialized ? "yes" : "no");
    printf("  vl53l0x_detected=%s last_model_id=0x%02X\r\n",
           g_vl53.detected ? "yes" : "no",
           g_vl53.last_model_id);
    printf("  vl53l0x_initialized=%s last_range_mm=%u read_count=%lu fail_count=%lu\r\n",
           g_vl53.initialized ? "yes" : "no",
           (unsigned int)g_vl53.last_range_mm,
           (unsigned long)g_vl53.read_count,
           (unsigned long)g_vl53.read_fail_count);
    if (sensor_ok)
    {
        int32_t temp_centi = round_float_to_centi(g_sensor.temperature_c);
        int32_t altitude_centi = round_float_to_centi(g_sensor.altitude_m);
        int32_t pressure_pa_i = round_float_to_int(g_sensor.pressure_pa);
        uint32_t temp_abs_centi = (temp_centi < 0) ? (uint32_t)(-temp_centi) : (uint32_t)temp_centi;
        uint32_t altitude_abs_centi = (altitude_centi < 0) ? (uint32_t)(-altitude_centi) : (uint32_t)altitude_centi;

