embeddedci-com/examples/scenario-sensors-stm32/main.c
        printf("  temperature=%s%lu.%02lu C\r\n",
               (temp_centi < 0) ? "-" : "",
               (unsigned long)(temp_abs_centi / 100U),
               (unsigned long)(temp_abs_centi % 100U));
        printf("  pressure=%ld Pa\r\n", (long)pressure_pa_i);
        printf("  altitude=%s%lu.%02lu m\r\n",
               (altitude_centi < 0) ? "-" : "",
               (unsigned long)(altitude_abs_centi / 100U),
               (unsigned long)(altitude_abs_centi % 100U));
    }
    else
    {
        printf("  sensor_read=FAILED\r\n");
    }
    printf("  read_count=%lu fail_count=%lu\r\n",
           (unsigned long)g_sensor.read_count,
           (unsigned long)g_sensor.read_fail_count);
    printf("  rx_byte_count=%lu\r\n", (unsigned long)rx_byte_count);
    printf("  command_count=%lu\r\n", (unsigned long)command_count);
    printf("  tick=%lu ms\r\n", (unsigned long)HAL_GetTick());
}

static void set_rotors(GPIO_PinState state)
{
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10 | GPIO_PIN_11, state);
}

/* Parse the first unsigned decimal integer in s; return defval if none present. */
static uint32_t parse_u32_default(const char *s, uint32_t defval)
{
    while (*s == ' ')
    {
        s++;
    }
    if (*s < '0' || *s > '9')
    {
        return defval;
    }
    uint32_t v = 0U;
    while (*s >= '0' && *s <= '9')
    {
        v = (v * 10U) + (uint32_t)(*s - '0');
        s++;
    }
    return v;
}

/* Drive PC10 (STEP) with `steps` pulses; PC11 (DIR) selects direction.
 * Returns the number of steps actually issued (a key press aborts early). */
static uint32_t rotor_step(uint32_t steps, int reverse)
{
    HAL_GPIO_WritePin(STEP_PORT, DIR_PIN, reverse ? GPIO_PIN_SET : GPIO_PIN_RESET);
    HAL_Delay(1); /* let DIR settle before the first STEP edge */

    uint32_t done = 0U;
    for (uint32_t i = 0U; i < steps; i++)
    {
        if (usart1_read_byte_nonblocking(&rx_byte))
        {
            break; /* any key aborts a long move */
        }
        HAL_GPIO_WritePin(STEP_PORT, STEP_PIN, GPIO_PIN_SET);
        HAL_Delay(STEP_HALF_PERIOD_MS);
        HAL_GPIO_WritePin(STEP_PORT, STEP_PIN, GPIO_PIN_RESET);
        HAL_Delay(STEP_HALF_PERIOD_MS);
        done++;
    }
    return done;
}

/* "rotors step <n> [fwd|rev]" — args points just past "rotors step". */
static void handle_rotor_step(const char *args)
{
    while (*args == ' ')
    {
        args++;
    }
    if (*args < '0' || *args > '9')
    {
        printf("usage: rotors step <n> [fwd|rev]\r\n");
        return;
    }

    uint32_t steps = 0U;
    const char *p = args;
    while (*p >= '0' && *p <= '9')
    {
        steps = (steps * 10U) + (uint32_t)(*p - '0');
        if (steps > STEP_MAX_COUNT)
        {
            steps = STEP_MAX_COUNT;
        }
        p++;
    }

    int reverse = 0;
    while (*p == ' ')
    {
        p++;
    }
    if (*p != '\0')
    {
        char c = *p;
        if (c == 'r' || c == 'R')
        {
            reverse = 1;
        }
        else if (c == 'f' || c == 'F')
        {
            reverse = 0;
        }
        else
        {
            printf("unknown direction '%s' (use fwd|rev)\r\n", p);
            return;
        }
    }

    if (steps == 0U)
    {
        printf("STEP: count=0, nothing to do\r\n");
        return;
    }

    printf("STEP: %lu step(s) dir=%s (PC10=STEP, PC11=DIR=%s) at ~%u steps/s\r\n",
           (unsigned long)steps,
           reverse ? "rev" : "fwd",
           reverse ? "HIGH" : "LOW",
           (unsigned int)(1000U / (2U * STEP_HALF_PERIOD_MS)));
    uint32_t done = rotor_step(steps, reverse);
    if (done < steps)
    {
        printf("STEP aborted: %lu/%lu step(s) %s\r\n",
               (unsigned long)done, (unsigned long)steps, reverse ? "rev" : "fwd");
    }
    else
    {
        printf("STEP done: %lu step(s) %s\r\n", (unsigned long)done, reverse ? "rev" : "fwd");
    }
}

/* Bring up TIM2 in PWM-input mode on PA0 (TI1): CH1 (direct, rising) captures the
 * period, CH2 (indirect, falling) the high time, and TI1 rising resets the counter
 * (slave reset mode). Timebase is 1 MHz so a capture value is directly in us. */
static void pwm_input_init(void)
{
    uint32_t timclk = HAL_RCC_GetPCLK1Freq();
    /* APB1 timer clock is doubled unless the APB1 prescaler is 1 (PPRE1 field >= 4). */
    if (((RCC->CFGR & RCC_CFGR_PPRE1) >> RCC_CFGR_PPRE1_Pos) >= 4U)
    {
        timclk *= 2U;
    }
    uint32_t prescaler = timclk / PWM_TIM_HZ;
    if (prescaler == 0U)
    {
        prescaler = 1U;
    }

    g_pwm_tim.Instance = TIM2;
    g_pwm_tim.Init.Prescaler = prescaler - 1U;
    g_pwm_tim.Init.CounterMode = TIM_COUNTERMODE_UP;
    g_pwm_tim.Init.Period = 0xFFFFFFFFU; /* TIM2 is 32-bit; never wraps mid-period */
    g_pwm_tim.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    g_pwm_tim.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    if (HAL_TIM_IC_Init(&g_pwm_tim) != HAL_OK)
    {
        printf("PWM monitor: TIM2 init failed\r\n");
        return;
    }

    TIM_IC_InitTypeDef sIC = {0};
    sIC.ICPolarity = TIM_ICPOLARITY_RISING;
    sIC.ICSelection = TIM_ICSELECTION_DIRECTTI; /* CH1 <- TI1: period */
    sIC.ICPrescaler = TIM_ICPSC_DIV1;
    sIC.ICFilter = 0U;
    (void)HAL_TIM_IC_ConfigChannel(&g_pwm_tim, &sIC, TIM_CHANNEL_1);

    sIC.ICPolarity = TIM_ICPOLARITY_FALLING;
    sIC.ICSelection = TIM_ICSELECTION_INDIRECTTI; /* CH2 <- TI1: high time */
    (void)HAL_TIM_IC_ConfigChannel(&g_pwm_tim, &sIC, TIM_CHANNEL_2);

    TIM_SlaveConfigTypeDef sSlave = {0};
    sSlave.SlaveMode = TIM_SLAVEMODE_RESET;
    sSlave.InputTrigger = TIM_TS_TI1FP1;
    sSlave.TriggerPolarity = TIM_TRIGGERPOLARITY_RISING;
    sSlave.TriggerPrescaler = TIM_TRIGGERPRESCALER_DIV1;
    sSlave.TriggerFilter = 0U;
    (void)HAL_TIM_SlaveConfigSynchro(&g_pwm_tim, &sSlave);

    (void)HAL_TIM_IC_Start(&g_pwm_tim, TIM_CHANNEL_1);
    (void)HAL_TIM_IC_Start(&g_pwm_tim, TIM_CHANNEL_2);
}

static void pwm_input_deinit(void)
{
    (void)HAL_TIM_IC_Stop(&g_pwm_tim, TIM_CHANNEL_1);
    (void)HAL_TIM_IC_Stop(&g_pwm_tim, TIM_CHANNEL_2);
    (void)HAL_TIM_IC_DeInit(&g_pwm_tim);
}

