embeddedci-com/examples/scenario-sensors-stm32/main.c
/* One PWM measurement. Returns 0 with freq/duty/period filled, or -1 if no full
 * PWM period is seen within PWM_MEAS_WINDOW_MS (signal lost / stuck / stalled). */
static int pwm_measure(uint32_t *freq_hz, uint32_t *duty_pct, uint32_t *period_us)
{
    uint32_t start = HAL_GetTick();

    /* Discard the first capture (partial period after we start looking), then wait
     * for a second, full period. Two edges also proves the signal actually toggles. */
    __HAL_TIM_CLEAR_FLAG(&g_pwm_tim, TIM_FLAG_CC1);
    while (!__HAL_TIM_GET_FLAG(&g_pwm_tim, TIM_FLAG_CC1))
    {
        if ((HAL_GetTick() - start) > PWM_MEAS_WINDOW_MS)
        {
            return -1;
        }
    }
    __HAL_TIM_CLEAR_FLAG(&g_pwm_tim, TIM_FLAG_CC1);
    while (!__HAL_TIM_GET_FLAG(&g_pwm_tim, TIM_FLAG_CC1))
    {
        if ((HAL_GetTick() - start) > PWM_MEAS_WINDOW_MS)
        {
            return -1;
        }
    }

    uint32_t period = HAL_TIM_ReadCapturedValue(&g_pwm_tim, TIM_CHANNEL_1);
    uint32_t high = HAL_TIM_ReadCapturedValue(&g_pwm_tim, TIM_CHANNEL_2);
    if (period == 0U)
    {
        return -1;
    }
    if (high > period)
    {
        high = period;
    }
    *period_us = period;
    *freq_hz = PWM_TIM_HZ / period;
    *duty_pct = (high * 100U) / period;
    return 0;
}

static void monitor_pwm_until_key(uint32_t period_sec)
{
    uint32_t period_ms = period_sec * 1000U;

    pwm_input_init();
    printf("monitoring PWM on PA0 (TIM2_CH1) every %lu s (press any key to stop)\r\n",
           (unsigned long)period_sec);
    printf("failure = no PWM edges within %u ms (signal lost / motor stalled)\r\n",
           (unsigned int)PWM_MEAS_WINDOW_MS);

    uint32_t next_ms = HAL_GetTick();
    uint32_t cycle = 0U;
    while (1)
    {
        if (usart1_read_byte_nonblocking(&rx_byte))
        {
            printf("\r\nPWM monitor stopped\r\n");
            break;
        }

        uint32_t now = HAL_GetTick();
        if ((int32_t)(now - next_ms) >= 0)
        {
            cycle++;
            uint32_t freq = 0U;
            uint32_t duty = 0U;
            uint32_t per = 0U;
            if (pwm_measure(&freq, &duty, &per) == 0)
            {
                printf("cycle=%lu tick=%lu ms PWM ok: freq=%lu Hz duty=%lu%% period=%lu us\r\n",
                       (unsigned long)cycle,
                       (unsigned long)now,
                       (unsigned long)freq,
                       (unsigned long)duty,
                       (unsigned long)per);
            }
            else
            {
                printf("cycle=%lu tick=%lu ms failure detected: no PWM on PA0 (signal lost)\r\n",
                       (unsigned long)cycle,
                       (unsigned long)now);
                break; /* stop monitoring on failure */
            }
            next_ms += period_ms;
        }
    }
    pwm_input_deinit();
}

void HAL_TIM_IC_MspInit(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM2)
    {
        __HAL_RCC_GPIOA_CLK_ENABLE();
        __HAL_RCC_TIM2_CLK_ENABLE();

        GPIO_InitTypeDef GPIO_InitStruct = {0};
        GPIO_InitStruct.Pin = GPIO_PIN_0; /* PA0 = TIM2_CH1 */
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        /* Pull-down so a disconnected input reads low (no edges = failure detected)
         * rather than floating and decoding spurious "PWM". */
        GPIO_InitStruct.Pull = GPIO_PULLDOWN;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
        GPIO_InitStruct.Alternate = GPIO_AF1_TIM2;
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
    }
}

void HAL_TIM_IC_MspDeInit(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM2)
    {
        __HAL_RCC_TIM2_CLK_DISABLE();
        HAL_GPIO_DeInit(GPIOA, GPIO_PIN_0);
    }
}

static void monitor_i2c_until_key(void)
{
    uint32_t next_print_ms = HAL_GetTick();
    float last_altitude_m = 0.0f;
    uint8_t have_prev = 0U;

    if (i2c1_ensure_init() != 0)
    {
        printf("monitor aborted: I2C1 init failed\r\n");
        return;
    }
    if (bmp280_probe_and_init(1U) != 0)
    {
        printf("monitor note: BMP280 init failed (reads may fail until sensor responds)\r\n");
    }
    if (vl53l0x_init(1U) != 0)
    {
        printf("monitor note: VL53L0X init failed (will retry during reads)\r\n");
    }
    printf("monitoring BMP280 + VL53L0X every 1 second (press any key to stop)\r\n");
    while (1)
    {
        if (usart1_read_byte_nonblocking(&rx_byte))
        {
            printf("\r\nmonitor stopped\r\n");
            break;
        }

        uint32_t now = HAL_GetTick();
        if ((int32_t)(now - next_print_ms) >= 0)
        {
            if (bmp280_read_measurement(&g_sensor.temperature_c, &g_sensor.pressure_pa, &g_sensor.altitude_m) == 0)
            {
                g_sensor.read_count++;
                int32_t temp_centi = round_float_to_centi(g_sensor.temperature_c);
                int32_t altitude_centi = round_float_to_centi(g_sensor.altitude_m);
                int32_t pressure_pa_i = round_float_to_int(g_sensor.pressure_pa);
                uint32_t temp_abs_centi = (temp_centi < 0) ? (uint32_t)(-temp_centi) : (uint32_t)temp_centi;
                uint32_t altitude_abs_centi = (altitude_centi < 0) ? (uint32_t)(-altitude_centi) : (uint32_t)altitude_centi;
                const char *trend = "-";
                if (have_prev)
                {
                    if (g_sensor.altitude_m > (last_altitude_m + 0.05f))
                    {
                        trend = "up";
                    }
                    else if (g_sensor.altitude_m < (last_altitude_m - 0.05f))
                    {
                        trend = "down";
                    }
                    else
                    {
                        trend = "flat";
                    }
                }
                printf("tick=%lu ms temp=%s%lu.%02lu C pressure=%ld Pa altitude=%s%lu.%02lu m trend=%s\r\n",
                       (unsigned long)now,
                       (temp_centi < 0) ? "-" : "",
                       (unsigned long)(temp_abs_centi / 100U),
                       (unsigned long)(temp_abs_centi % 100U),
                       (long)pressure_pa_i,
                       (altitude_centi < 0) ? "-" : "",
                       (unsigned long)(altitude_abs_centi / 100U),
                       (unsigned long)(altitude_abs_centi % 100U),
                       trend);
                last_altitude_m = g_sensor.altitude_m;
                have_prev = 1U;
            }
            else
            {
                g_sensor.read_fail_count++;
                printf("tick=%lu ms BMP280 read failed\r\n", (unsigned long)now);
                printf("BMP280 failed -> recovering I2C\r\n");
                i2c_recover();
            }
            uint16_t range_mm = 0U;
            if (vl53l0x_read_range_mm(&range_mm, 0U) == 0)
            {
                g_vl53.read_count++;
                printf("tick=%lu ms VL53L0X range=%u mm\r\n",
                       (unsigned long)now,
                       (unsigned int)range_mm);
            }
            else
            {
                g_vl53.read_fail_count++;
                printf("tick=%lu ms VL53L0X read failed\r\n", (unsigned long)now);
                printf("VL53 failed -> recovering I2C\r\n");
                i2c_recover();
            }
            next_print_ms += 1000U;
        }
    }
}

static void sensor_init_until_key(void)
{
    uint32_t next_init_ms = HAL_GetTick();
    uint32_t init_attempt = 0U;
    uint8_t did_scan = 0U;

    if (i2c1_ensure_init() != 0)
    {
        printf("sensor init aborted: I2C1 init failed\r\n");
        return;
    }
    printf("retrying BMP280 + VL53L0X every 500ms (press any key to stop)\r\n");
    while (1)
    {
        if (usart1_read_byte_nonblocking(&rx_byte))
        {
            printf("\r\nsensor init retry stopped\r\n");
            break;
        }

        uint32_t now = HAL_GetTick();
        if ((int32_t)(now - next_init_ms) >= 0)
        {
            if (did_scan == 0U)
            {
                did_scan = 1U;
                printf("one-shot I2C scan:\r\n");
                i2c_bus_scan();
            }
            init_attempt++;
            printf("sensor init attempt=%lu\r\n", (unsigned long)init_attempt);
            if (bmp280_probe_and_init(1U) == 0)
            {
                printf("BMP280 init OK (addr=0x%02X)\r\n", g_sensor.i2c_addr_7b);
            }
            else
            {
                printf("BMP280 init FAILED\r\n");
            }
            printf("VL53L0X init:\r\n");
            if (vl53l0x_init(1U) == 0)
            {
                uint16_t range_mm = 0U;
                if (vl53l0x_read_range_mm(&range_mm, 1U) == 0)
                {
                    g_vl53.read_count++;
                    printf("VL53L0X read OK range=%u mm\r\n", (unsigned int)range_mm);
                }
                else
                {
                    g_vl53.read_fail_count++;
                    printf("VL53L0X init OK, read FAILED\r\n");
                    printf("VL53 failed -> recovering I2C\r\n");
                    i2c_recover();
                }
            }
            else
            {
                printf("VL53L0X init FAILED\r\n");
            }
            next_init_ms += 500U;
        }
    }
}

