embeddedci-com/examples/scenario-sensors-stm32/main.c
static int bmp280_probe_and_init(uint8_t verbose)
{
    uint8_t addresses[2] = {BMP280_I2C_ADDR0, BMP280_I2C_ADDR1};
    uint8_t chip_id = 0U;

    if (verbose)
    {
        printf("BMP280 init start\r\n");
    }

    g_sensor.detected = 0U;
    g_sensor.initialized = 0U;
    for (uint32_t i = 0; i < 2U; i++)
    {
        g_sensor.i2c_addr_7b = addresses[i];
        if (verbose)
        {
            printf("BMP280 init: probe addr=0x%02X\r\n", g_sensor.i2c_addr_7b);
        }

        if (bmp280_read_regs(BMP280_REG_CHIP_ID, &chip_id, 1U, verbose) == 0 && chip_id == BMP280_CHIP_ID)
        {
            g_sensor.detected = 1U;
            if (verbose)
            {
                printf("BMP280 init: chip id match=0x%02X at addr=0x%02X\r\n", chip_id, g_sensor.i2c_addr_7b);
            }
            break;
        }
        else if (verbose)
        {
            printf("BMP280 init: probe miss at addr=0x%02X (chip_id=0x%02X)\r\n", g_sensor.i2c_addr_7b, chip_id);
        }
    }
    if (!g_sensor.detected)
    {
        if (verbose)
        {
            printf("BMP280 init FAILED: no device responded with chip id 0x%02X\r\n", BMP280_CHIP_ID);
        }
        return -1;
    }

    if (bmp280_write_reg(BMP280_REG_RESET, 0xB6U, verbose) != 0)
    {
        if (verbose)
        {
            printf("BMP280 init FAILED: reset write failed\r\n");
        }
        return -1;
    }
    HAL_Delay(5);

    uint8_t status = 0x01U;
    for (uint32_t tries = 0; tries < 20U && (status & 0x01U) != 0U; tries++)
    {
        if (bmp280_read_regs(BMP280_REG_STATUS, &status, 1U, verbose) != 0)
        {
            if (verbose)
            {
                printf("BMP280 init FAILED: status read failed (try=%lu)\r\n", (unsigned long)(tries + 1U));
            }
            return -1;
        }
        if (verbose)
        {
            printf("BMP280 init: status=0x%02X (try=%lu)\r\n", status, (unsigned long)(tries + 1U));
        }
        HAL_Delay(2);
    }
    if ((status & 0x01U) != 0U)
    {
        if (verbose)
        {
            printf("BMP280 init FAILED: status busy timeout\r\n");
        }
        return -1;
    }

    uint8_t calib[24];
    if (bmp280_read_regs(BMP280_REG_CALIB_START, calib, sizeof(calib), verbose) != 0)
    {
        if (verbose)
        {
            printf("BMP280 init FAILED: calibration read failed\r\n");
        }
        return -1;
    }
    g_calib.dig_T1 = (uint16_t)((calib[1] << 8) | calib[0]);
    g_calib.dig_T2 = (int16_t)((calib[3] << 8) | calib[2]);
    g_calib.dig_T3 = (int16_t)((calib[5] << 8) | calib[4]);
    g_calib.dig_P1 = (uint16_t)((calib[7] << 8) | calib[6]);
    g_calib.dig_P2 = (int16_t)((calib[9] << 8) | calib[8]);
    g_calib.dig_P3 = (int16_t)((calib[11] << 8) | calib[10]);
    g_calib.dig_P4 = (int16_t)((calib[13] << 8) | calib[12]);
    g_calib.dig_P5 = (int16_t)((calib[15] << 8) | calib[14]);
    g_calib.dig_P6 = (int16_t)((calib[17] << 8) | calib[16]);
    g_calib.dig_P7 = (int16_t)((calib[19] << 8) | calib[18]);
    g_calib.dig_P8 = (int16_t)((calib[21] << 8) | calib[20]);
    g_calib.dig_P9 = (int16_t)((calib[23] << 8) | calib[22]);

    if (bmp280_write_reg(BMP280_REG_CONFIG, 0x00U, verbose) != 0)
    {
        if (verbose)
        {
            printf("BMP280 init FAILED: config write failed\r\n");
        }
        return -1;
    }
    if (bmp280_write_reg(BMP280_REG_CTRL_MEAS, 0x27U, verbose) != 0)
    {
        if (verbose)
        {
            printf("BMP280 init FAILED: ctrl_meas write failed\r\n");
        }
        return -1;
    }

    g_sensor.initialized = 1U;
    if (verbose)
    {
        printf("BMP280 init done: addr=0x%02X\r\n", g_sensor.i2c_addr_7b);
    }
    return 0;
}

static int bmp280_read_measurement(float *temperature_c, float *pressure_pa, float *altitude_m)
{
    if (!g_sensor.detected || !g_sensor.initialized)
    {
        return -1;
    }

    uint8_t raw[6];
    if (bmp280_read_regs(BMP280_REG_PRESS_MSB, raw, sizeof(raw), 0U) != 0)
    {
        return -1;
    }

    int32_t adc_P = (int32_t)(((uint32_t)raw[0] << 12) | ((uint32_t)raw[1] << 4) | ((uint32_t)raw[2] >> 4));
    int32_t adc_T = (int32_t)(((uint32_t)raw[3] << 12) | ((uint32_t)raw[4] << 4) | ((uint32_t)raw[5] >> 4));

    int32_t temp_x100 = bmp280_compensate_temp(adc_T);
    uint32_t press_q24_8 = bmp280_compensate_press(adc_P);
    if (press_q24_8 == 0U)
    {
        return -1;
    }

    *temperature_c = ((float)temp_x100) / 100.0f;
    *pressure_pa = ((float)press_q24_8) / 256.0f;
    *altitude_m = pressure_to_altitude_m(*pressure_pa);
    return 0;
}

static int bmp280_read_regs(uint8_t reg, uint8_t *buf, uint16_t len, uint8_t verbose)
{
    HAL_StatusTypeDef status = HAL_I2C_Mem_Read(&g_sensor.hi2c1,
                                                (uint16_t)(g_sensor.i2c_addr_7b << 1),
                                                reg,
                                                I2C_MEMADD_SIZE_8BIT,
                                                buf,
                                                len,
                                                BMP280_TIMEOUT_MS);
    if (verbose)
    {
        printf("BMP280 I2C READ addr=0x%02X reg=0x%02X len=%u -> %s",
               g_sensor.i2c_addr_7b,
               reg,
               (unsigned int)len,
               hal_status_to_str(status));
        if (status != HAL_OK)
        {
            printf(" err=0x%08lX", (unsigned long)HAL_I2C_GetError(&g_sensor.hi2c1));
        }
        printf("\r\n");
    }
    if (status != HAL_OK)
    {
        return -1;
    }
    return 0;
}

static int bmp280_write_reg(uint8_t reg, uint8_t value, uint8_t verbose)
{
    HAL_StatusTypeDef status = HAL_I2C_Mem_Write(&g_sensor.hi2c1,
                                                 (uint16_t)(g_sensor.i2c_addr_7b << 1),
                                                 reg,
                                                 I2C_MEMADD_SIZE_8BIT,
                                                 &value,
                                                 1U,
                                                 BMP280_TIMEOUT_MS);
    if (verbose)
    {
        printf("BMP280 I2C WRITE addr=0x%02X reg=0x%02X val=0x%02X -> %s",
               g_sensor.i2c_addr_7b,
               reg,
               value,
               hal_status_to_str(status));
        if (status != HAL_OK)
        {
            printf(" err=0x%08lX", (unsigned long)HAL_I2C_GetError(&g_sensor.hi2c1));
        }
        printf("\r\n");
    }
    if (status != HAL_OK)
    {
        return -1;
    }
    return 0;
}

static const char *hal_status_to_str(HAL_StatusTypeDef status)
{
    switch (status)
    {
    case HAL_OK:
        return "OK";
    case HAL_ERROR:
        return "ERROR";
    case HAL_BUSY:
        return "BUSY";
    case HAL_TIMEOUT:
        return "TIMEOUT";
    default:
        return "UNKNOWN";
    }
}

