embeddedci-com/examples/scenario-sensors-stm32/main.c
static void i2c_dump_hal_error_bits(uint32_t err)
{
    if (err == 0U)
    {
        return;
    }
    printf(" bits=");
    if ((err & HAL_I2C_ERROR_BERR) != 0U)
    {
        printf("BERR ");
    }
    if ((err & HAL_I2C_ERROR_ARLO) != 0U)
    {
        printf("ARLO ");
    }
    if ((err & HAL_I2C_ERROR_AF) != 0U)
    {
        printf("AF ");
    }
    if ((err & HAL_I2C_ERROR_OVR) != 0U)
    {
        printf("OVR ");
    }
    if ((err & HAL_I2C_ERROR_DMA) != 0U)
    {
        printf("DMA ");
    }
    if ((err & HAL_I2C_ERROR_TIMEOUT) != 0U)
    {
        printf("TIMEOUT ");
    }
}

static void i2c_dump_hal_context(const char *tag, HAL_StatusTypeDef st)
{
    uint32_t err = HAL_I2C_GetError(&g_sensor.hi2c1);
    printf("%s: HAL=%s(%d) err=0x%08lX state=%u prev=%u errCode=0x%08lX",
           tag,
           hal_status_to_str(st),
           (int)st,
           (unsigned long)err,
           (unsigned int)g_sensor.hi2c1.State,
           (unsigned int)g_sensor.hi2c1.PreviousState,
           (unsigned long)g_sensor.hi2c1.ErrorCode);
    i2c_dump_hal_error_bits(err);
    printf("\r\n");
}

static void i2c_recover(void)
{
    HAL_StatusTypeDef st = HAL_I2C_DeInit(&g_sensor.hi2c1);
    i2c_dump_hal_context("HAL_I2C_DeInit(recover)", st);
    HAL_Delay(2U);
    g_i2c1_hw_inited = 0U;
    st = HAL_I2C_Init(&g_sensor.hi2c1);
    i2c_dump_hal_context("HAL_I2C_Init(recover)", st);
    g_i2c1_hw_inited = (st == HAL_OK) ? 1U : 0U;
    if (st == HAL_OK)
    {
        vl53l0x_port_set_i2c(&g_sensor.hi2c1);
    }
    HAL_Delay(2U);
}

static int i2c1_ensure_init(void)
{
    if (g_i2c1_hw_inited != 0U)
    {
        return 0;
    }

    printf("I2C1 init requested\r\n");
    I2C1_Init();
    if (g_i2c1_hw_inited == 0U)
    {
        printf("I2C1 init failed; scan/read operations are blocked\r\n");
        return -1;
    }
    return 0;
}

static void i2c_bus_scan(void)
{
    printf("I2C scan 0x%02X-0x%02X IsDeviceReady(trials=%u to=%ums)\r\n",
           I2C_SCAN_ADDR_FIRST,
           I2C_SCAN_ADDR_LAST,
           (unsigned int)I2C_ISREADY_TRIALS,
           (unsigned int)I2C_ISREADY_TIMEOUT_MS);
    uint32_t found = 0U;
    for (uint32_t a = I2C_SCAN_ADDR_FIRST; a <= I2C_SCAN_ADDR_LAST; a++)
    {
        HAL_StatusTypeDef st = HAL_I2C_IsDeviceReady(&g_sensor.hi2c1,
                                                     (uint16_t)(a << 1),
                                                     I2C_ISREADY_TRIALS,
                                                     I2C_ISREADY_TIMEOUT_MS);
        if (st == HAL_OK)
        {
            printf("  FOUND 0x%02lX", (unsigned long)a);
            if (a == (uint32_t)VL53L0X_I2C_ADDR_7B)
            {
                printf(" (VL53L0X default addr)");
            }
            printf("\r\n");
            found++;
        }
        else
        {
            printf("  0x%02lX: %s", (unsigned long)a, hal_status_to_str(st));
            printf(" err=0x%08lX state=%u", (unsigned long)HAL_I2C_GetError(&g_sensor.hi2c1), (unsigned int)g_sensor.hi2c1.State);
            i2c_dump_hal_error_bits(HAL_I2C_GetError(&g_sensor.hi2c1));
            printf("\r\n");
        }
    }
    printf("scan done: found=%lu device(s)\r\n", (unsigned long)found);
}

static int vl53l0x_read_model_id(uint8_t verbose)
{
    uint8_t val = VL53L0X_readReg(&g_vl53_dev, IDENTIFICATION_MODEL_ID);
    g_vl53.last_model_id = val;
    if (verbose)
    {
        printf("VL53L0X reg 0x%02X read: i2c_status=%u data=0x%02X (expect 0x%02X)\r\n",
               IDENTIFICATION_MODEL_ID,
               (unsigned int)g_vl53_dev.last_status,
               val,
               VL53L0X_MODEL_ID_EXPECTED);
    }
    if (g_vl53_dev.last_status != 0U)
    {
        g_vl53.detected = 0U;
        return -1;
    }
    g_vl53.detected = (val == VL53L0X_MODEL_ID_EXPECTED) ? 1U : 0U;
    if (val == VL53L0X_MODEL_ID_EXPECTED)
    {
        if (verbose)
        {
            printf("VL53L0X model ID OK\r\n");
        }
        return 0;
    }
    if (verbose)
    {
        printf("VL53L0X model ID mismatch\r\n");
    }
    return -1;
}

static int vl53l0x_init(uint8_t verbose)
{
    if (i2c1_ensure_init() != 0)
    {
        g_vl53.initialized = 0U;
        return -1;
    }
    g_vl53_dev.io_2v8 = true;
    g_vl53_dev.address = VL53L0X_I2C_ADDR_7B;
    g_vl53_dev.io_timeout = BMP280_TIMEOUT_MS;
    g_vl53_dev.did_timeout = false;

    if (!VL53L0X_init(&g_vl53_dev))
    {
        g_vl53.detected = 0U;
        g_vl53.initialized = 0U;
        if (verbose)
        {
            printf("VL53L0X init failed (driver)\r\n");
        }
        return -1;
    }
    if (VL53L0X_setMeasurementTimingBudget(&g_vl53_dev, 20000U) == false && verbose)
    {
        printf("VL53L0X timing budget set failed; continuing\r\n");
    }
    if (vl53l0x_read_model_id(verbose) != 0)
    {
        g_vl53.initialized = 0U;
        return -1;
    }
    g_vl53.initialized = 1U;
    if (verbose)
    {
        printf("VL53L0X init OK (third-party driver)\r\n");
    }
    return 0;
}

static int vl53l0x_read_range_mm(uint16_t *range_mm, uint8_t verbose)
{
    if (range_mm == NULL)
    {
        return -1;
    }
    if (g_vl53.initialized == 0U)
    {
        if (vl53l0x_init(verbose) != 0)
        {
            return -1;
        }
    }

    uint16_t range = VL53L0X_readRangeSingleMillimeters(&g_vl53_dev);
    bool timed_out = VL53L0X_timeoutOccurred(&g_vl53_dev);
    if (g_vl53_dev.last_status != 0U || timed_out || range == 65535U)
    {
        g_vl53.initialized = 0U;
        if (verbose)
        {
            printf("VL53L0X range read failed: i2c_status=%u timeout=%u range=%u\r\n",
                   (unsigned int)g_vl53_dev.last_status,
                   timed_out ? 1U : 0U,
                   (unsigned int)range);
        }
        return -1;
    }
    *range_mm = range;
    g_vl53.last_range_mm = *range_mm;
    if (verbose)
    {
        printf("VL53L0X range read: %u mm\r\n", (unsigned int)(*range_mm));
    }
    return 0;
}

static int sensor_i2c_deinit(void)
{
    HAL_StatusTypeDef st = HAL_I2C_DeInit(&g_sensor.hi2c1);
    i2c_dump_hal_context("HAL_I2C_DeInit", st);
    g_i2c1_hw_inited = 0U;
    memset(&g_calib, 0, sizeof(g_calib));
    g_sensor.detected = 0U;
    g_sensor.initialized = 0U;
    g_sensor.i2c_addr_7b = 0U;
    g_vl53.detected = 0U;
    g_vl53.initialized = 0U;
    g_vl53.last_model_id = 0U;
    g_vl53.last_range_mm = 0U;
    g_vl53.read_count = 0U;
    g_vl53.read_fail_count = 0U;
    return (st == HAL_OK) ? 0 : -1;
}

static int32_t bmp280_compensate_temp(int32_t adc_T)
{
    int32_t var1 = ((((adc_T >> 3) - ((int32_t)g_calib.dig_T1 << 1))) * ((int32_t)g_calib.dig_T2)) >> 11;
    int32_t var2 = (((((adc_T >> 4) - ((int32_t)g_calib.dig_T1)) * ((adc_T >> 4) - ((int32_t)g_calib.dig_T1))) >> 12) *
                    ((int32_t)g_calib.dig_T3)) >>
                   14;
    g_calib.t_fine = var1 + var2;
    return (g_calib.t_fine * 5 + 128) >> 8;
}

static uint32_t bmp280_compensate_press(int32_t adc_P)
{
    int64_t var1 = ((int64_t)g_calib.t_fine) - 128000;
    int64_t var2 = var1 * var1 * (int64_t)g_calib.dig_P6;
    var2 = var2 + ((var1 * (int64_t)g_calib.dig_P5) << 17);
    var2 = var2 + (((int64_t)g_calib.dig_P4) << 35);
    var1 = ((var1 * var1 * (int64_t)g_calib.dig_P3) >> 8) + ((var1 * (int64_t)g_calib.dig_P2) << 12);
    var1 = (((((int64_t)1) << 47) + var1) * ((int64_t)g_calib.dig_P1)) >> 33;
    if (var1 == 0)
    {
        return 0;
    }

    int64_t p = 1048576 - adc_P;
    p = (((p << 31) - var2) * 3125) / var1;
    var1 = (((int64_t)g_calib.dig_P9) * (p >> 13) * (p >> 13)) >> 25;
    var2 = (((int64_t)g_calib.dig_P8) * p) >> 19;
    p = ((p + var1 + var2) >> 8) + (((int64_t)g_calib.dig_P7) << 4);
    return (uint32_t)p;
}

